app/views/comments/_comment.html.erb

          <% if current_user %>
            <% check_vote = comment.votes.find { |vote| vote.author_id == current_user.id} %>
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]