app/helpers/posts_helper.rb

  def full_name(post)
    "#{Author.find(post.author_id).first_name.capitalize} #{Author.find(post.author_id).last_name.capitalize}"
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]