app/views/posts/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <div class="col-sm-10">
      <%= form.collection_select(:author_id, Author.all, :id, :full_name)%>