app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
  </div><!-- carusel-->
  <div > <!--Post.first-->