app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "bill"], ["body", "ldlasdpsajfidfvncvmdfbogfbdfb"], ["post_id", 1], ["created_at", "2019-11-18 14:25:11.044187"], ["updated_at", "2019-11-18 14:25:11.044187"]]
---
  def create
    @comment = @post.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def find_comment
    @comment = @post.comments.find(params[:id])