app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "posts".* FROM "posts"
---
  def index
    # seach in db with paginate
    if params[:search]
      @posts = Post.search(params[:search]).order(created_at: :desc).paginate(page: params[:page], per_page: 3)
    else
      @posts = Post.all.order(created_at: :desc).paginate(page: params[:page], per_page: 3)
    end
    @post = Post.first

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Удаление связанных объектов"], ["content", "grrgggggggggggggg"], ["created_at", "2019-11-18 21:28:19.210433"], ["updated_at", "2019-11-18 21:28:19.210433"], ["author_id", 1]]
---
  def create
    if @current_user.baned == false
    @post = current_user.posts.build(post_params)

      respond_to do |format|
        if @post.save

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3
---
  def update
    # If not a owner- you cant edit/destroy
    redirect_to root_path if owner == false

    respond_to do |format|
      if @post.update_attributes(post_params)